In [105]:
%matplotlib inline
import pandas as pd

In [11]:
titles = pd.read_csv('cast.csv')
titles.head()

,title,year,name,type,character,n
0,A '28-as',1943,?gnes Alm?ssy,actress,Rokons?g tagja,NaN
1,A 45 revoluciones por minuto,1969,Rafael Alonso,actor,Manolo Montero,4.0
2,A Aa,2016,Ananya,actress,Bhanumati,8.0
3,A Aa E Ee,2009,Aravind Akash,actor,Ilango,4.0
4,A Bahraini Tale,2006,Saad Abdulla,actor,Salim,NaN

In [15]:
cast = pd.read_csv('cast.csv')
cast.head()

,title,year,name,type,character,n
0,A '28-as',1943,?gnes Alm?ssy,actress,Rokons?g tagja,NaN
1,A 45 revoluciones por minuto,1969,Rafael Alonso,actor,Manolo Montero,4.0
2,A Aa,2016,Ananya,actress,Bhanumati,8.0
3,A Aa E Ee,2009,Aravind Akash,actor,Ilango,4.0
4,A Bahraini Tale,2006,Saad Abdulla,actor,Salim,NaN

In [12]:
title = pd.read_csv('C:/Users/Arohan/Downloads/batch 55-22 august zip/batch 55-22 august zip/titles.csv')
title.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

### How many movies are listed in the titles dataframe?

In [170]:
len(titles)

73991

### What are the earliest two films listed in the titles dataframe?

In [171]:
titles.sort_values(by='year').head(2)

,title,year,name,type,character,n
21679,"From the Manger to the Cross; or, Jesus of Naz...",1912,James D. Ainsley,actor,John the Baptist,6.0
51109,Satana,1912,Rina Albry,actress,Una cortigiana,6.0

### How many movies have the title "Hamlet"?

In [193]:
len(titles[titles.title =="Halmet"])

0

### How many movies are titled "North by Northwest"?

In [173]:
len(titles[titles.title =="North by Northwest"])

2

### When was the first movie titled "Hamlet" made?

In [175]:
titles[titles.title =="Halmet"].year.mean()

nan

### List all of the "Treasure Island" movies from earliest to most recent.

In [177]:
titles[titles.title =="Treasure Island"].sort_values(by='year')

,title,year,name,type,character,n
68048,Treasure Island,1934,Robert Adair,actor,Tom - Seaman,NaN
68049,Treasure Island,1950,Chris Adcock,actor,Pike,26.0
68051,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,16.0
68052,Treasure Island,1972,Alibe,actress,Mrs. Silver,12.0
68050,Treasure Island,1985,Yves Afonso,actor,French Captain,8.0

### How many movies were made in the year 1950?

In [179]:
len(titles[titles.year ==1950])

371

### How many movies were made in the year 1960?

In [181]:
len(titles[titles.year == 1960])

339

### How many movies were made from 1950 through 1959?

In [183]:
len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

3869

### In what years has a movie titled "Batman" been released?

In [185]:
titles[titles.title =="batman"]

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were there in the movie "Inception"?

In [187]:
len(titles[titles.title =="Inception"])

7

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [188]:
len(titles[(titles.title =="Inception") & (titles.n.isnull())])

2

### But how many roles in the movie "Inception" did receive an "n" value?

In [199]:
len(titles[(titles.title =="Inception") & (titles.n.notnull())])

5

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [212]:
titles[(titles.title == "North by Northwest") & (titles.n.notnull())].sort_values(by='n')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [213]:
titles[(titles.title == "Seluth") & (titles.year == 1972) & (titles.n.notnull())].sort_values(by='n')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### Now display the entire cast, in "n"-order, of the 2007 version of "Seluth".

In [215]:
titles[(titles.title == "Seluth") & (titles.year == 1972) & (titles.n.notnull())].sort_values(by='n')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were credited in the silent 1921 version of Hamlet?

In [216]:
len(titles[(titles.title== "Hamlet") & (titles.year == 1921)])

1

### How many roles were credited in Branagh’s 1996 Hamlet?

In [217]:
len(titles[(titles.title== "Hamlet") & (titles.year == 1966)])

0

### How many "Hamlet" roles have been listed in all film credits through history?

In [220]:
len(titles[titles.character == "Hamlet"])

1

### How many people have played an "Ophelia"?

In [225]:
len(titles[titles.character== "Ophelia"])

0

### How many people have played a role called "The Dude"?

In [226]:
len(titles[titles.character== "The Dude"])

0

### How many people have played a role called "The Stranger"?

In [227]:
len(titles[titles.character== "The Stranger"])

2

### How many roles has Sidney Poitier played throughout his career?

In [228]:
len(titles[titles.name== "Sidney Poitier"])

0

### How many roles has Judi Dench played?

In [232]:
len(titles[titles.name== "Judi Dench"])

0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [238]:
titles[(titles.name == "Cary Grant") & (titles.year // 10 == 194) & (titles.n == 2)].sort_values(by='year')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

In [246]:
titles[(titles.name == "Ananya") & (titles.year // 10 == 200) & (titles.n.notnull())].sort_values(by='year')

            title  year    name     type  character    n
41467  Naadodigal  2009  Ananya  actress  Nallamaal  4.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [247]:
titles[(titles.name == "Cary Grant") & (titles.year // 10 == 194) & (titles.n == 2)].sort_values(by='year')

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles were available for actors in the 1950s?

In [252]:
len(titles[(titles.year //10 == 195) & (titles.type =='actor')])

2862

### How many roles were available for actresses in the 1950s?

In [254]:
len(titles[(titles.year //10 == 195) & (titles.type =='actress')])

1007

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [258]:
len(titles[(titles.year <= 1980) & (titles.n == 1)])

1304

### How many non-leading roles were available through from the beginning of film history through 1980?

In [259]:
len(titles[(titles.year <= 1980) & (titles.n != 1)])

20222

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [260]:
len(titles[(titles.year <= 1980) & (titles.n.isnull())])

8094